# -*- org-src-preserve-indentation: t; org-edit-src-content: 0; -*-
#+TITLE: Result Visualization
#+AUTHOR: Rohit Goswami
#+EMAIL: rohit.goswami@epfl.ch
# This should not be altered
#+OPTIONS: toc:nil title:nil todo:nil
# I need the footnotes to be inlined
#+STARTUP: fninline

*** Summaries
#+begin_src R :results value :colnames yes :post round-tbl[:colnames yes](*this*)
df_long %>%
  group_by(Method) %>%
  summarise(
    mean_rmsd   = mean(RMSD_Saddle, na.rm = TRUE),
    median_rmsd = median(RMSD_Saddle, na.rm = TRUE),
    max_rmsd    = max(RMSD_Saddle, na.rm = TRUE),
    n_systems   = n()
  )
#+end_src

#+RESULTS[5811b43be79ef5469f029e803e19c7240a85ce0f]:
| Method | mean_rmsd | median_rmsd | max_rmsd | n_systems |
|--------+-----------+-------------+----------+-----------|
| CINEB  |       0.0 |         0.0 |      0.3 |        24 |
| RONEB  |       0.0 |         0.0 |      0.3 |        24 |


#+begin_src R :results value :colnames yes :post round-tbl[:colnames yes](*this*)
df_long %>%
  group_by(Method) %>%
  summarize(n=n(), mean=mean(pes_calls), median=median(pes_calls))
#+end_src

#+RESULTS[0cf46f5e8a4fe08ac381870960cf97687de3cd09]:
| Method |  n |  mean | median |
|--------+----+-------+--------|
| CINEB  | 24 | 790.7 |    482 |
| RONEB  | 24 | 445.9 |  230.5 |

